{
  "header": {
    "name": "Daniel Mesquita",
    "job": "Full-stack<0/>software developer"
  },
  "skills": {
    "title": "Habilidades",
    "contents": [
      {
        "subTitle": "Front-end",
        "text": "JavaScript, TypeScript, React, React Native, Next, Redux, HTML, CSS, Sass, Styled Components, WordPress, Firebase."
      },
      {
        "subTitle": "Back-end",
        "text": "Node, Express, Koa, Docker, Knex, Sequelize, Prisma, PostgreSQL, MongoDB, Redis, Nodemailer, AWS, Socket.io, Jest, Linux, Google Cloud, Strapi, Github Actions, Puppeteer."
      },
      {
        "subTitle": "Soft Skills",
        "text": "Adaptability, Persistence, Time management."
      }
    ]
  },
  "languages": {
    "title": "Languages",
    "contents": [
      {
        "alt": "US flag",
        "text": "English (Fluent)"
      },
      {
        "alt": "Brazil flag",
        "text": "Portuguese (Native)"
      }
    ]
  },
  "about": {
    "title": "Prepared for an endless learning journey, passionate about technology, programming and especially, evolution and daily growth. Use the QR Code to know more about me",
    "alt": "Website QR Code"
  },
  "main": [
    {
      "title": "Work Experience",
      "contents": [
        {
          "title": "Company Estúdio Flow:",
          "subContents": [
            {
              "title": [
                "PrimeAgro",
                "Management system and report generation for agronomists"
              ],
              "texts": [
                "Participations: Database modeling; API development; Seed creation; Documentation; Unitary tests; Automatically generating reports in excel; Heat map integrated with Google maps; Creating charts.",
                "Learnings: Improvement in Relational Database knowledge; Google Cloud."
              ]
            },
            {
              "title": [
                "Medfy",
                "UMC Hospital Doctors and Clinics Management System"
              ],
              "texts": [
                "Participations: Database modeling; API creation; Containerization with Docker; Documentation; Uploading files and sending emails with AWS; Frontend development (Tables, dynamic lists, drag-and-drop, etc.); Export data to excel.",
                "Learnings: Next; Docker and its ecosystem; AWS Console."
              ]
            },
            {
              "title": ["Acelera Prime", "Distance learning platform"],
              "texts": [
                "Participations: Building API and Admin dashboard with Strapi; Documentation; API certificate generation with Puppeteer.",
                "Learnings: Web scraping with Puppeteer; CMS Strapi."
              ]
            },
            {
              "title": ["OpinaHub", "Ratings and feedback system"],
              "texts": [
                "Participations: Database modeling; API creation; Frontend development; Animations with Framer Motion; Unitary tests; Deploy in Brazil Cloud.",
                "Learnings: Scripts to be inserted into third-party websites; Animations with Framer motion and CSS."
              ]
            },
            {
              "title": [
                "Cooperari",
                "Platform to search for candidates by its soft skills"
              ],
              "texts": [
                "Participations: API development; Integration with Drive to generate reports; Algorithm to match candidates and companies; Automated deployment with Github Actions.",
                "Learnings: CI/CD; Drive integration."
              ]
            }
          ]
        },
        {
          "title": "Freelancer:",
          "subContents": [
            {
              "title": ["Pedi Aqui", "Delivery System"],
              "texts": [
                "Participations: Database modeling; API development; Connection with web sockets; Deploy in heroku; Integration with mobile APP notifications.",
                "Learnings: Web sockets; Time management."
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Education",
      "contents": [
        {
          "title": "Graduation",
          "subContents": [
            {
              "title": ["UFU", "Information Systems Degree"],
              "texts": ["In progress"]
            }
          ]
        }
      ]
    }
  ]
}
